4nzor/gyverlamp-matter/matter-bridge/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"

# Use compact attribute storage mode
CONFIG_ESP_MATTER_NVS_USE_COMPACT_ATTR_STORAGE=y

# Status WS2812 is owned by status_led (GPIO48). Do not also bind BSP LED to it.
CONFIG_BSP_LEDS_NUM=0

# Buttons (factory reset)
CONFIG_BSP_BUTTONS_NUM=1
CONFIG_BSP_BUTTON_1_TYPE_GPIO=y
CONFIG_BSP_BUTTON_1_GPIO=0
CONFIG_BSP_BUTTON_1_LEVEL=0

# Do NOT pre-set CHIP DEFAULT_WIFI_*: Alice must provision Wi-Fi during Matter.
# Keep Gyver Bridge Kconfig for post-pair diagnostics only (unused for STA join).
CONFIG_GYVER_WIFI_SSID=""
CONFIG_GYVER_WIFI_PASSWORD=""
CONFIG_STATUS_LED_GPIO=48
